package Algorythms.homework_3;

// Task 2:
/* 2. Имея два отсортированных массива размера m и n соответственно, вам нужно найти элемент,
   который будет находиться на k-й позиции в конечном отсортированном массиве.
   Массив 1 - 100 112 256 349 770
   Массив 2 - 72 86 113 119 265 445 892
   k = 7, Вывод: 256
   Окончательный отсортированный массив -
    0(1)  1(2)  2(3)  3(4)  4(5)  5(6)  6(7)  7(8)  8(9)  9(10)  10(11)  11(12)
    72,  86,   100,  112,  113,  119,  256,  265,  349,  445,   770,    892
     7-й элемент этого массива равен 256. */

public class TwoSortedArrays {
    public static void main(String[] args) {

    }


}
